/*
1 から 100 までの数字をランダムに一つ生成する。
プレイヤーの予想した回数を記録する。最初は 1 回から。
プレイヤーが数字が何かを予想する方法を用意する。
予想が入力されたら、プレイヤーが以前の予想を見られるように、どこかに記録する。
入力された数字が正しいかどうかを調べる。
入力された数字が正しい場合...
正解したお祝いのメッセージを表示する。
プレイヤーが次の予想を出来ないようにする。(ゲームがおかしくならないように)
プレイヤーが次のゲームを始められるようなコントロールを表示する。
プレイヤーの予想が間違いで、予想回数の上限にはまだ達していない場合...
プレイヤーが間違っていることを表示する。
次の予想を入力できるようにする。
予想回数に 1 を加算する。
プレイヤーの予想が間違いで、予想回数の上限に達した場合...
プレイヤーにゲームオーバーであることを伝える。
プレイヤーが次の予想を出来ないようにする。(ゲームがおかしくならないように)
プレイヤーが次のゲームを始められるようなコントロールを表示する。
ゲームがもう一度始まったら、画面とロジックが完全にリセットされるようにして、1.に戻る。
*/
